src/Documents/КурьерскаяДоставка/КурьерскаяДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КурьерскаяДоставка</name>
  <registerRecords>AccumulationRegister.СобранныеЗаказы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Улица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаСбора</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыГруппыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОплаты</name>
    <type>
      <types>EnumRef.МетодыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьОплачиваетОрганизатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СобранныйЗаказ</name>
    <type>
      <types>CatalogRef.СобранныеЗаказы</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДоставки</name>
    <type>
      <types>EnumRef.СтатусыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетВыставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Напечатано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъявленнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыСПосылками</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>CatalogRef.Покупки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыНаСкладе</name>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DefinedType.ПартияПоступления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Праздники</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетОрганизатор</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОплачиваетУчастник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Потерян</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/Транзит/Транзит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Транзит</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПокупкаСсылка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>CatalogRef.Пристрой</types>
      <types>CatalogRef.Коробки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Точка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Движение</types>
      <types>DocumentRef.ФормированиеКоробки</types>
      <types>DocumentRef.КорректировкаЗаписейРегистров</types>
      <types>DocumentRef.ОтправлениеТранзита</types>
      <types>DocumentRef.Приходная</types>
      <types>DocumentRef.ПоступлениеПристроя</types>
      <types>DocumentRef.РазборКоробки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/НегабаритЗначения/НегабаритЗначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НегабаритЗначения</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>CatalogRef.Покупки</types>
      <types>CatalogRef.Заказы</types>
      <types>CatalogRef.Посылки</types>
      <types>String</types>
      <types>CatalogRef.Коробки</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПартияПоступления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ТарифыПоНаправлениям/ТарифыПоНаправлениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыПоНаправлениям</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Откуда</name>
    <type>
      <types>CatalogRef.ГородаСП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Куда</name>
    <type>
      <types>CatalogRef.ГородаСП</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыДоставки/СтатусыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоставки</name>
  <enumValues>
    <name>ОжидаетСборки</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/СобранныеЗаказы/СобранныеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СобранныеЗаказы</name>
  <attributes>
    <name>ДокументЗаказа</name>
    <type>
      <types>DocumentRef.КурьерскаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ШК</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/КурьерскаяДоставка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Область ПравильноеПроведение
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.КурьерскаяДоставка.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("ОстаткиТоваров", 	ДополнительныеСвойства, Движения, Отказ);
	СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("Транзит", 		ДополнительныеСвойства, Движения, Отказ);
	СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("СобранныеЗаказы", ДополнительныеСвойства, Движения, Отказ);
	
	
	
	
	#КонецОбласти
	

КонецПроцедуры


Процедура ЗаполнитьОстатками() экспорт
	Если ЗаказыСПосылками.Количество() = 0 Тогда
		ОбновитьГруппуДоставки();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Покупка Как Посылка,
		|	ОстаткиТоваровОстатки.МестоХранения,
		|	ОстаткиТоваровОстатки.Габарит,
		|	ОстаткиТоваровОстатки.Партия,
		|	СвояТочка.Значение Как ПунктВыдачи
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(&Период, Участник = &Участник
		|	И ТИПЗНАЧЕНИЯ(Покупка) = ТИП(Справочник.Посылки)) КАК ОстаткиТоваровОстатки,
		|	Константа.СвояТочка КАК СвояТочка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТранзитОстатки.ПокупкаСсылка,
		|	ТранзитОстатки.МестоХранения,
		|	ТранзитОстатки.Габарит,
		|	ТранзитОстатки.Партия,
		|	ТранзитОстатки.Точка
		|ИЗ
		|	РегистрНакопления.Транзит.Остатки(, Участник = &Участник
		|	и ТипЗначения(ПокупкаСсылка) = Тип(Справочник.Посылки)) КАК ТранзитОстатки
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.Посылка,
		|	Остатки.МестоХранения,
		|	Остатки.Габарит,
		|	Остатки.Партия,
		|	Остатки.ПунктВыдачи,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПраздничныеДни.Дата) КАК ПраздничныхДней,
		|	МАКСИМУМ(ЕСТЬNULL(НегабаритЗначения.Вес, 0)) КАК Вес,
		|	МАКСИМУМ(ЕСТЬNULL(НегабаритЗначения.объем, 0)) КАК Объем,
		|	ВЫРАЗИТЬ(МАКСИМУМ(Мегаордера.Ссылка) КАК Справочник.Мегаордера) КАК ШК
		|ПОМЕСТИТЬ втГабаритыШК
		|ИЗ
		|	Остатки КАК Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПраздничныеДни КАК ПраздничныеДни
		|		ПО (ПраздничныеДни.Дата > Остатки.Партия.Дата)
		|		И (ПраздничныеДни.Дата < &Период)
		|		И (НЕ ПраздничныеДни.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НегабаритЗначения КАК НегабаритЗначения
		|		ПО Остатки.Партия = НегабаритЗначения.Регистратор
		|		И Остатки.Посылка = НегабаритЗначения.Покупка
		|		И Остатки.Габарит = НегабаритЗначения.Габарит
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Мегаордера КАК Мегаордера
		|		ПО Остатки.Посылка = Мегаордера.Покупка
		|СГРУППИРОВАТЬ ПО
		|	Остатки.МестоХранения,
		|	Остатки.Габарит,
		|	Остатки.ПунктВыдачи,
		|	Остатки.Партия,
		|	Остатки.Посылка
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втГабаритыШК.Посылка,
		|	втГабаритыШК.МестоХранения,
		|	втГабаритыШК.Габарит,
		|	втГабаритыШК.Партия,
		|	втГабаритыШК.ПунктВыдачи,
		|	втГабаритыШК.ПраздничныхДней,
		|	РАЗНОСТЬДАТ(втГабаритыШК.Партия.Дата, &Период, ДЕНЬ) - ЕСТЬNULL(втГабаритыШК.ПраздничныхДней, 0) КАК ВремяХранения,
		|	втГабаритыШК.Вес,
		|	втГабаритыШК.Объем,
		|	ЕСТЬNULL(втГабаритыШК.ПраздничныхДней, 0) КАК Праздники,
		|	ЕСТЬNULL(ТарифыПоНаправлениямСрезПоследних.Стоимость, 0) КАК СтоимостьДоставки,
		|	втГабаритыШК.ШК
		|ИЗ
		|	втГабаритыШК КАК втГабаритыШК
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПоНаправлениям.СрезПоследних(&Период,) КАК ТарифыПоНаправлениямСрезПоследних
		|		ПО (ТарифыПоНаправлениямСрезПоследних.Куда = &СвойГород)
		|		И втГабаритыШК.Габарит = ТарифыПоНаправлениямСрезПоследних.Габарит
		|		И втГабаритыШК.Посылка.ПерваяТочка.ГородСП = ТарифыПоНаправлениямСрезПоследних.Откуда";
	
	Запрос.УстановитьПараметр("Участник", 	Участник);
	Запрос.УстановитьПараметр("Период", 	?(ЗначениеЗаполнено(Дата), Дата -1,КонецДня(Дата)));
	Запрос.УстановитьПараметр("СвойГород", 	Константы.СвояТочка.Получить().ГородСП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаказыНаСкладе.Загрузить(результатЗапроса.Выгрузить());
	
//	СписокПосылок	= ЗаказыНаСкладе.ВыгрузитьКолонку("Посылка");
//	СтоСПОбмен_Посылки.Загрузить_СоставПосылкиПоКодам(СписокПосылок);
	
	Для каждого элем из ЗаказыНаСкладе Цикл
		элем.Подбор	= (ЗаказыСПосылками.НайтиСтроки(новый Структура("Посылка", элем.Посылка)).Количество()>0);
				
				
		структураРассчета 			= аСПНаСервере.РассчитатьСтоимостьХранения(Новый структура("Габарит, ВремяХранения, СтоимостьДоставки, БесплатнаяВыдача, вес,Объем", 
//																								элем.Габарит, элем.ВремяХранения, элем.СтоимостьДоставки, элем.Посылка.БесплатнаяВыдача,Элем.вес,Элем.Объем));
																								элем.Габарит, элем.ВремяХранения, элем.СтоимостьДоставки, ложь,Элем.вес,Элем.Объем));
		элем.СтоимостьИтого			= структураРассчета.СтоимостьИтого;
		элем.ОплачиваетОрганизатор  = структураРассчета.ОплачиваетОрганизатор;
		элем.ОплачиваетУчастник		= структураРассчета.ОплачиваетУчастник;
		элем.СтоимостьХранения		= структураРассчета.СтоимостьХранения;
	КонецЦикла;
	
	СтоимостьОплачиваетОрганизатор 	= ЗаказыНаСкладе.Итог("ОплачиваетОрганизатор");
	СтоимостьХранения 				= ЗаказыНаСкладе.Итог("СтоимостьИтого");//Доставка до ПВ
	СтоимостьИтого					= СтоимостьХранения + СтоимостьДоставки; //Курьерская доставка
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если не  ЗначениеЗаполнено(СобранныйЗаказ) и ЗначениеЗаполнено(Ссылка) Тогда 
		СобранныйЗаказ = Справочники.СобранныеЗаказы.НайтиПоКоду(Номер);
		Если не ЗначениеЗаполнено(СобранныйЗаказ) Тогда
			обСобранныйЗаказ 				= Справочники.СобранныеЗаказы.СоздатьЭлемент();
			обСобранныйЗаказ.Наименование	= "Заказ КД ("+Номер+")"; 
			обСобранныйЗаказ.Код 			= Номер;
			обСобранныйЗаказ.ДокументЗаказа	= Ссылка;
			обСобранныйЗаказ.ШК				= СП_РаботаСоСправочниками.ПолучитьМегаордерПоШК("45"+Формат(обСобранныйЗаказ.Код,"ЧЦ=8; ЧН=0; ЧВН=; ЧГ=0;"));
			обСобранныйЗаказ.Записать();
			СобранныйЗаказ 					= обСобранныйЗаказ.Ссылка; 
			ПараметрыШК	=	Новый Структура("Покупка, СобранныйЗаказ", СобранныйЗаказ,СобранныйЗаказ);
			СП_РаботаСоСправочниками.ОбновитьМегаордер(обСобранныйЗаказ.ШК, ПараметрыШК)
			
		КонецЕсли;	
	КонецЕсли;	
	
	Если Адрес = "" Тогда
		ПолучитьАдресДоставки_Api();
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И  
		 СтатусДоставки = Перечисления.СтатусыДоставки.ОжидаетСборки	Тогда
		Если ЗаказыНаСкладе.НайтиСтроки(Новый Структура("Подбор",Истина)).Количество()>0  Тогда
			СтатусДоставки = Перечисления.СтатусыДоставки.Собран;
		Иначе
			СтатусДоставки = Перечисления.СтатусыДоставки.Отменен;
		КонецЕсли	
	КонецЕсли;	
	
//	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И не СчетВыставлен Тогда
//		ВыставитьСчет_Api();
//	КонецЕсли;
		
		
КонецПроцедуры
	


Процедура ВыставитьСчет_Api() Экспорт
	Отправили 	= СП_КурьерскаяДоставка.ТекстЗапроса_Счет_Api(ЭтотОбъект);
	Получили 	= ОтправитьНаСайт(Отправили);
	Если Получили.Результат Тогда
		сз = новый СписокЗначений();
		сз.Добавить(номер);
		результат = СтоСПОбмен_ГруппыДоставки.Загрузить_ПоКодам(сз, истина);	
		СП_КурьерскаяДоставка.ДокументКурьерскойДоставки_из_Api(результат.deliveryGroups[0],ЭтотОбъект);
		СчетВыставлен = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьГруппуДоставки() Экспорт
		сз = новый СписокЗначений();
		сз.Добавить(номер);
		результат = СтоСПОбмен_ГруппыДоставки.Загрузить_ПоКодам(сз, истина);	
		результат.deliveryGroups.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.КурьерскаяДоставка") );
		СП_КурьерскаяДоставка.ДокументКурьерскойДоставки_из_Api(результат.deliveryGroups[0],ЭтотОбъект);
КонецПроцедуры


Функция ПолучитьАдресДоставки_Api() Экспорт
	результат = СП_АдресаДоставки.выполнитьЗапрос(Заказы[0].КодЗаказа,Ссылка );
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат.СтруктураАдреса);
КонецФункции


Функция ОтправитьНаСайт(Отправили) 
	СтрокаПротокола						= 	новый Структура ("ДатаНачала, ДатаОкончания,Отправили, Результат, ПолученныеДанные");
	СтрокаПротокола.Отправили			= Отправили;
	СтрокаПротокола.ДатаНачала			=	ТекущаяДата();
	
	АдресСкрипта 		= Константы.АдресВыгрузкиНасайт.Получить();
	Параметры    		= новый Структура;
	Параметры.Вставить("token",	Константы.Токен.Получить());
	Параметры.Вставить("xml", 	Отправили);
	
	ПолученныйФайл		= СтоСПОбмен_Общий.ПолучитьПостЗапросом(Параметры,АдресСкрипта);
	
	Если ПолученныйФайл	= Неопределено Тогда 		
		СтрокаПротокола.Результат		= Ложь; 
		СтрокаПротокола.ДатаОкончания	= ТекущаяДата();
		Возврат СтрокаПротокола;	
	КонецЕсли; 
	Если аспПроцедурыОбменаДанными.АвторизацияВыполнена(ПолученныйФайл) Тогда
		СтрокаПротокола.Результат= Истина;
		СтрокаПротокола.ПолученныеДанные	=  СтоСПОбмен_Общий.ФайлВСтроку(ПолученныйФайл);
	Иначе
		СтрокаПротокола.ПолученныеДанные	= "Авторизация не выполнена" + СтоСПОбмен_Общий.ФайлВСтроку(ПолученныйФайл);
	КонецЕсли;	
	СтрокаПротокола.ДатаОкончания			= ТекущаяДата();
	СтоСПОбмен_Выгрузка100сп.СохранитьПротоколОбмена(СтрокаПротокола,Ссылка);
	Возврат СтрокаПротокола;
КонецФункции
